src/Catalogs/ИнтеграцияRMQБрокеры/ИнтеграцияRMQБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтеграцияRMQБрокеры</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВиртуальногоХоста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИнтеграцияRMQБрокеры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
		
// Возвращает параметры брокера
// 
// Параметры:
// 	Брокер - СправочникСсылка.ИнтеграцияRMQБрокеры - Ссылка на брокера
// Возвращаемое значение:
// 	
Функция ПараметрыБрокера(Брокер) Экспорт
	
	Результат = Новый Структура; 

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИнтеграцияRMQБрокеры.Ссылка КАК Брокер,
	|	ИнтеграцияRMQБрокеры.Сервер,
	|	ИнтеграцияRMQБрокеры.Порт,
	|	ИнтеграцияRMQБрокеры.ИмяВиртуальногоХоста,
	|	ИнтеграцияRMQБрокеры.Логин
	|ИЗ
	|	Справочник.ИнтеграцияRMQБрокеры КАК ИнтеграцияRMQБрокеры
	|ГДЕ
	|	ИнтеграцияRMQБрокеры.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Брокер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);		
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Результат.Брокер = Справочники.ИнтеграцияRMQБрокеры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
